Tekla.Structures.Geometry3d.FacetedBrepFaceHole
The FacetedBrepFaceHole class defines a hole on a faceted BREP face.
A FacetedBrepFaceHole cannot be instantiated directly. They are managed internally by a FacetedBrepFace.
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
FacetedBrep brep = SomeFunctionThatReturnFacetedBrep();
foreach (FacetedBrepFace face in brep.Faces)
{
foreach (FacetedBrepFaceHole hole in face.Holes)
{
foreach (Vector vertex in hole.Vertices)
{
Console.WriteLine("Hole point x:{0} y:{1} z:{2}", vertex.X, vertex.Y, vertex.Z);
}
}
}
}
}